{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Metadata file describing a feature request involving updating the HeroSection to use a new logo asset.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend landing page components and marketing config updates.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark mode values, and base styles.",
  "frontend/index.html": "Static HTML shell defining meta tags and loading the React app entrypoint.",
  "frontend/src/App.tsx": "Root React component rendering the LandingPage.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes the full landing page by rendering all major sections in order.",
  "frontend/src/components/landing/sections/CalendlySection.tsx": "Consultation booking section with Calendly CTA and supporting text.",
  "frontend/src/components/landing/sections/CaseStudiesSection.tsx": "Displays three case studies with metrics and implemented changes using cards.",
  "frontend/src/components/landing/sections/Footer.tsx": "Footer showing copyright info and a link to caffeine.ai with dynamic year and hostname.",
  "frontend/src/components/landing/sections/HeroSection.tsx": "Hero section with background image, updated CCPG logo, headline, credentials, and CTA button.",
  "frontend/src/components/landing/sections/OfferSection.tsx": "Offer section promoting conversion optimization services with benefit blocks and CTA.",
  "frontend/src/components/landing/sections/ProcessSection.tsx": "Outlines a four-step optimization process using cards and short descriptions.",
  "frontend/src/config/marketing.ts": "Exports marketing constants including Calendly URL, tagline, and company credential strings.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor using the current Internet Identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including loading, login, and logout handling.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom CSS variables for light/dark themes, and utility classes for status colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, plugins, and extended utilities tied to CSS variable-driven design.",
  "project_state.json": "Stores project metadata including features, requirements, and image assets for the hero logo update."
}