{
  "kind": "build_request",
  "title": "Replace only the top-of-page hero logo with uploaded CCPG logo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add the user-uploaded logo image (\"CCPG logo.png\") as a static asset under frontend/public/assets/generated, and update the top-of-page (hero) logo in frontend/src/components/landing/sections/HeroSection.tsx to use this new asset instead of the current /assets/generated/ccpg-logo-transparent.dim_512x128.png.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "The main log at the very top of the page only"
        ]
      },
      "acceptanceCriteria": [
        "A new logo image derived from the uploaded \"CCPG logo.png\" exists under frontend/public/assets/generated with the filename specified in this build request.",
        "HeroSection renders the new generated logo image at the very top of the page (the centered logo/wordmark block).",
        "No other logos/images elsewhere in the app are changed as part of this update.",
        "The hero logo remains responsive and visually aligned (keeps h-12 w-auto on mobile and sm:h-16 on larger screens or equivalent sizing behavior)."
      ]
    }
  ],
  "constraints": [
    "Frontend paths listed as immutable in SYSTEM_CONTEXT must not be edited.",
    "Replace only the main top-of-page (hero) logo; do not change any other logos or images elsewhere in the app."
  ],
  "nonGoals": [
    "Updating the hero background image or any carousel behavior.",
    "Changing any marketing copy, colors/theme, or layout outside the top-of-page logo swap.",
    "Backend changes (no Motoko changes expected)."
  ],
  "imageRequirements": {
    "required": [
      "Square black-and-white brand logo on a white background (ccpg-logo-top.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}